freePiston/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
//    div(phi,U)      Gauss upwind;

//    div(phi,K)      Gauss upwind;
    div(phi,e)     Gauss upwind;
  //  div(phid,p)     Gauss upwind;
//    div(meshPhi,p)  Gauss upwind;
    div(phiv,p)     Gauss upwind;
//    div(phi,k)      Gauss upwind;
//    div(phi,epsilon) Gauss upwind;
//    div(phi,R)      Gauss upwind;
  // div(R)          Gauss linear;
/*    div(phi,ft_b_ha_hau) Gauss multivariateSelection
    {
        fu  limitedLinear01 1;
        ft  limitedLinear01 1;
        b   limitedLinear01 1;
        ha  limitedLinear 1;
        hau limitedLinear 1;
        ea  limitedLinear 1;
        eau limitedLinear 1;
    };*/
  //  div(U)          Gauss linear;
  //  div((Su*n)) Gauss linear;
  //  div((U+((Su*Xi)*n))) Gauss linear;
  //  div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;


    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,h)      Gauss linearUpwind grad(h);
    div(phi,K)      Gauss linear;
    div(meshPhi,p)  Gauss linear;
    div(phi,k)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;


}

laplacianSchemes
{
//    default         Gauss linear limited corrected 0.5;
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
  //  default         limited corrected 0.5;
	default corrected;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
