freePiston/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
{
        name    fRight;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
//            box (-0.0001 -0.1 -0.1) (0.0001 0.1 0.1); // boxes ((-0.0001 -0.1 0) (0.0001 0.1 0.05) (-0.0201 -0.1 0) (-0.0199 0.1 0.05));
			box (0.124 -1 -1) (0.126 1 1);
        }
}
{
        name    fLeft;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.0049 -1 -1) (0.0051 1 1); // box (0 -0.1 -0.0101) (0.05 0.1 -0.0099);
//			box (0.0099 -0.1 -0.1) (0.0101 0.1 0.1);
        }
}
{
        name    cRight;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
//			box (0 -0.1 -0.1) (0.001 0.1 0.1); // boxes ((0 -0.1 0) (0.002 0.1 0.05) (-0.02 -0.1 0) (-0.018 0.1 0.05));
			box (1 -1 -1) (0.126 1 1);
		}
}
{
        name    cLeft;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1 -1 -1) (0.005 1 1); // box (0 -0.1 -0.012) (0.05 0.1 -0.01);
//			box (0.009 -0.1 -0.1) (0.01 0.1 0.1);
        }
}
{
        name    leftExtrusionFaces;
        type    faceZoneSet;
        action  new;
        source  setsToFaceZone;
        sourceInfo
        {
            faceSet fLeft;
            cellSet cLeft;
            flip    true;
        }
}
{
        name    rightExtrusionFaces;
        type    faceZoneSet;
        action  new;
        source  setsToFaceZone;
        sourceInfo
        {
            faceSet fRight;
            cellSet cRight;
            flip    true;
        }
}
);
