freePiston/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

if [ -d 0 ] ; then
   rm -rf 0
fi

cp -r 0.orig 0

runApplication $(getApplication)

#------------------------------------------------------------------------------
